roadmap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>roadmap</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="roadmap"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-29 18:52:10 MSK"/>
<meta name="author" content="Urist McLisper"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/worg.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">roadmap</h1>

<p>Пока что здесь находится roadmap неизвестных (в <i>df</i> кто-то постил
это), не с целью нагло копировать, а с целью аккумулировать полезный
опыт, не забыть про какие-то аспекты, моменты, фичи.
</p>

<p>
Своего roadmap'а пока что нету, все находится в зачаточном состоянии.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 ROADMAP из <code>/df/</code></a>
<ul>
<li><a href="#sec-1-1">1.1 версия 0.1</a></li>
<li><a href="#sec-1-2">1.2 версия 0.2</a></li>
<li><a href="#sec-1-3">1.3 версия 0.3</a></li>
<li><a href="#sec-1-4">1.4 версия 0.4</a></li>
<li><a href="#sec-1-5">1.5 версия 0.5</a></li>
<li><a href="#sec-1-6">1.6 версия 0.6</a></li>
<li><a href="#sec-1-7">1.7 версия 1.0</a></li>
<li><a href="#sec-1-8">1.8 версия 1.1</a></li>
<li><a href="#sec-1-9">1.9 версия 1.2</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ROADMAP из <code>/df/</code></h2>
<div class="outline-text-2" id="text-1">

<p>Вся разработка ведётся открытым способом в публичном репозитории (гитхаб, гуглокод или типа того). 
Между каждым официальным выпуском совершаются десятки и сотни коммитов. Присвоение номера и выпуск (с постиками в бложеках и на бордочках) осуществляются когда все перечисленные условия выполнены. Какие-то подсистемы могут развиваться быстрее остальных и опережать график, в таких случаях релиз всё равно будет ждать отстающих. 
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> версия 0.1</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>мир 100x100x100 тайлов 
</li>
<li>целиком в памяти 
</li>
<li>три вида минералов 
</li>
<li>если парсер равок готов - пусть будет и минералы берутся из него, иначе аккуратно захардкодим их до поры. 
</li>
<li>примитивный генератор мира (генерим карту высот, заливаем всё первым минералом, местами делаем вкрапления второго и третьего минерала)
</li>
<li>мир как-то можно смотреть 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> версия 0.2</h3>
<div class="outline-text-3" id="text-1-2">

<ol>
<li>в мир вводится понятие "кадра" или "тика" 
</li>
<li>жидкости текут 
</li>
<li>мир генерируется более-менее интересно (но без городов, русел рек и т.п., просто зайчатки геологии) 
</li>
<li>парсер равок, по возможности всякие параметры берутся через него 
</li>
<li>редактор карт (без него сложно отлаживать жидкости) 
</li>
<li>первые структуры (стены) 
</li>
<li>Начинается генератор цивилизаций и городов 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> версия 0.3</h3>
<div class="outline-text-3" id="text-1-3">

<ol>
<li>хороший, годный парсер равок, всё берётся из него, включая вязкость жидкостей 
</li>
<li>первые существа 
</li>
<li>генератор мира окончательно становится процедурным, отпадает нужда хранить все тайлы. Мир становится большим. 
</li>
<li>загружается и играется только часть мира 
</li>
<li>Жидкости хорошо текут, работают сообщающиеся сосуды. Как-то надо решить вопрос с реками, текущими за пределы загруженной области. Можно как в df, можно (если получится) более честно обсчитывать ток рек (сделал плотину @ город в ста верстах ниже по течению вымер от жажды). 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> версия 0.4</h3>
<div class="outline-text-3" id="text-1-4">

<ol>
<li>Первые прототипы клиентского кода. Ещё без сети, но уже со строгой изоляцией от потрохов игровой логики, с ограниченной видимостью и, конечно, с возможностью управления существом (пока только одним). Графон - какой получится: текст, от стоунсенса, от майнтеста, от Quake 4. Лишь бы было. 
</li>
<li>ИИ существ. Лучше начать со случая "охотник-жертва". 
</li>
<li>Ведётся работа над генератором мира (геология, реки, селения), на совместимость сейвов кладётся болт. 
</li>
<li>есть какие-то существа, которых можно осмысленно поселить в города. 
</li>
<li>органы существ, ранения 
</li>
<li>вводим разные материалы 
</li>
<li>вводим понятие температуры, эффекты горения, плавления и т.д. 
</li>
<li>примитивная боёвка 
</li>
<li>мультитайловые структуры (типа мастерских) 
</li>
<li>структуры, способные менять прозрачность и проходимость (иными словами, ворота и подъёмные мосты). Корректная работа поля зрения игрока и течения жидкостей. 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> версия 0.5</h3>
<div class="outline-text-3" id="text-1-5">

<ol>
<li>Сетевая подсистема, первые попытки игры &gt;1 игрока в одном мире 
</li>
<li>Предметы. Одежда (надета), инструменты (в руках и прочих подходящих конечностях), хлам на земле. 
</li>
<li>Создаётся "дварфийский хайвмайнд", игрок может отдавать какие-то приказы, а входящие в хайвмайнд существа будут их выполнять, их ИИ должен быть соответствующим образом доработан. 
</li>
<li>Если заглянуть в город - кто-то там должен суетиться и как-то изображать жизнь. 
</li>
<li>система органов поддерживает создание форготни и НЁХ и вся эта херня логично живёт и убивается. 
</li>
<li>Улучшения по всем направлениям: генератор мира, ИИ, физика, биология, больше равок. 
</li>
<li>развитая боёвка 
</li>
<li>баллистика (не только ядра, но и отрубленные конечности) 
</li>
<li>обрушения конструкций. Сопромат, все дела. 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> версия 0.6</h3>
<div class="outline-text-3" id="text-1-6">

<ol>
<li>игра в режиме крепости по сети (не обязательно должно быть интересно и комфортно, но должно технически работать). 
</li>
<li>Ещё больше всяких ништяков. 
</li>
<li>боёвка не хуже, чем в df 
</li>
<li>Улучшения по всем направлениям 
</li>
<li>Генератор цивилизаций порождает всяких королей-личей, Подземелья С Эпичными Названиями, легенды и биографии. 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> версия 1.0</h3>
<div class="outline-text-3" id="text-1-7">

<ol>
<li>Сингловый режим крепости дворфов полноценен и играбелен, хотя и не такой насыщенный всякой всячиной, как в df. Есть нобли, армия, дворфы жрут, пьют, радуются, злятся, работают, рожают детей и умирают. 
</li>
<li>Существа знают легенды и помнят важные события, свидетелями которых были. 
</li>
<li>Мультиплеер в статусе "экспериментально". Если удастся решить геймплейные дилеммы типа "Вася хочет поставить на паузу, а Петя - промотать пару сезонов", то хорошо. Иначе - без паузы или с глобальной паузой. 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> версия 1.1</h3>
<div class="outline-text-3" id="text-1-8">

<ol>
<li>больше фич 
</li>
<li>Мультиплеер готов и рекомендован к использованию. 
</li>
</ol>


</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> версия 1.2</h3>
<div class="outline-text-3" id="text-1-9">

<ol>
<li>Нью-васюки становятся мировой шахматной столицей, открывается международный аэропорт.
</li>
</ol>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-01-29 18:52:10 MSK</p>
<p class="author">Author: Urist McLisper</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
